<template>
  <div class="modal-overlay" v-if="props.showAgreementModal">
    <div class="modal-container">
      <div class="modal-content">
        <h1>Согласие</h1>
        <h2>посетителя сайта на обработку персональных данных</h2>

        <p>
          Настоящим свободно, своей волей и в своем интересе даю согласие
          <span class="highlight">ИП Жуйковой Татьяне Игоревне (ОГРНИП 318032700037304)</span>,
          <span class="highlight">ИП Мацук Елизавете Трофимовне (ОГРНИП 325030000027200)</span>,
          на автоматизированную и неавтоматизированную обработку моих персональных данных,
          в том числе с использованием интернет-сервисов с использованием интернет-сервисов
          Google analytics, Яндекс.Метрика, LiveInternet, Рейтинг Mail.ru, Google Doubleclick
          в соответствии со следующим перечнем:
        </p>

        <ul>
          <li>Фамилия, имя, отчество и условия заказа, в случае его оформления;</li>
          <li>источник захода на сайт icemetr.ru (далее – Сайт) и информация поискового или рекламного запроса;</li>
          <li>данные о пользовательском устройстве (среди которых разрешение, версия и другие атрибуты, характеризующие
            пользовательское устройство);</li>
          <li>пользовательские клики, просмотры страниц, заполнения полей, показы и просмотры баннеров и видео;</li>
          <li>данные, характеризующие аудиторные сегменты;</li>
          <li>параметры сессии;</li>
          <li>данные о времени посещения;</li>
          <li>идентификатор пользователя, хранимый в cookie;</li>
          <li>использование фото- и видеоматериалов с моим изображением, сделанных во время посещения мною Ледовой арены
            IcеМетр, во внешних коммуникациях и/или коммерческих, рекламных целях,</li>
        </ul>

        <p>
          для целей повышения осведомленности посетителей Сайта <span class="highlight">icemetr.ru</span> о продуктах и
          услугах <span class="highlight">icemetr.ru</span>,
          предоставления релевантной рекламной информации и оптимизации рекламы.
        </p>

        <p>
          <span class="highlight">ИП Жуйкова Т.И., ИП Мацук Е.Т.</span> вправе осуществлять обработку моих персональных
          данных следующими способами:
          <span class="highlight">сбор, запись, систематизация, накопление, хранение, обновление, изменение,
            использование</span>.
        </p>

        <p class="highlight">
          Настоящее согласие вступает в силу с момента моего перехода на Сайт <span class="highlight">icemetr.ru</span>
          и действует до окончания цели обработки либо до момента письменного отзыва согласия на обработку персональных
          данных пользователя.
        </p>
      </div>

      <div class="modal-footer">
        <button class="primary" @click="closeModal">Принять</button>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { defineProps, defineEmits } from 'vue';

const props = defineProps({
  showAgreementModal: {
    type: Boolean,
    required: true
  }
})

const emit = defineEmits(['close'])

const closeModal = () => {
  emit('close');
}
</script>

<style scoped>
@import "../assets/modals-styles.css";
</style>
