<template>
  <div class="modal-overlay" v-if="props.showPolicyModal">
    <div class="modal-container">

      <div class="modal-content">
        <h1>Политика конфиденциальности</h1>
        <p class="policy-date">"УТВЕРЖДАЮ"</p>
        <p class="policy-date">Индивидуальный предприниматель Мацук Елизавета Трофимовна<br>Август 2025 года</p>

        <div class="policy-section">
          <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
          <p>Настоящая политика обработки персональных данных составлена в соответствии с положениями Конституции
            Российской Федерации, Гражданского кодекса Российской Федерации, Федерального закона от 27.07.2006 №149-ФЗ
            «Об информации, информационных технологиях и о защите информации», Федерального закона от 27.07.2006.
            №152-ФЗ «О персональных данных» (далее - Закон о персональных данных) и определяет порядок обработки
            персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые Индивидуальным
            предпринимателем Мацук Елизаветой Трофимовной (далее – Оператор).</p>

          <p>1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение защиты
            персональных данных всех Пользователей Сайта Оператора, данные которых подлежат обработке исключительно в
            целях осуществления предпринимательской деятельности Оператора (оказание услуг по розничной торговле, прием
            заказов при онлайн продажах, доставка товара и т.д.), в том числе соблюдения законодательства Российской
            Федерации в области связи, соблюдения прав и свобод человека и гражданина при обработке его персональных
            данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.</p>

          <p>1.2. Индивидуальный предприниматель Мацук Елизавета Трофимовна- является оператором, осуществляющий
            обработку персональных данных и включен в реестр под регистрационным номером: 3-19-001315</p>

          <p>1.3. Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется
            ко всей информации, которую Оператор может получить о посетителях веб-сайта: https://icemetr.ru/</p>

          <p>1.4. Оператор вправе в любое время вносить изменения в Политику конфиденциальности. При изменении Политики
            конфиденциальности Оператор уведомляет об этом Пользователей в порядке размещения новой редакции на Сайте по
            постоянному адресу.</p>

          <p>1.5. Продолжение использования Сайта Пользователем после размещения Политики конфиденциальности в новой
            редакции признается Сторонами безусловным принятием Пользователем условий Политики конфиденциальности в
            полном объеме.</p>

          <h2>2. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</h2>
          <p>2.1. Персональные данные - любая информация, относящаяся к определенному или определяемому на основании
            такой информации физическому лицу (субъекту персональных данных). Т.е. к такой информации, в частности,
            можно отнести любую предоставленную пользователем информацию: фамилия, имя, отчество, номер телефона,
            электронная почта, а также другую информацию.</p>

          <p>2.2. Обработка персональных данных – любое действие (операция) или совокупность действий (операций),
            совершаемых с использованием средств автоматизации или без использования таких средств с персональными
            данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение),
            извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование,
            удаление, уничтожение персональных данных. При этом передача осуществляется в соответствии с законными
            предписаниями уполномоченных органов или в соответствии с условиями договора, при подписании которого
            Пользователь дает свое согласие на такую обработку.</p>

          <p>2.3. Конфиденциальность персональных данных - обязательное для соблюдения допущенными к обработке
            персональных данных пользователей сотрудников Компании требование надлежаще соблюдать правила их обработки,
            хранения, не допускать их распространения без согласия субъекта или иного законного основания, а также
            обеспечение Компанией необходимого режима сохранности персональных данных пользователя.</p>

          <p>2.4. Оператор – Индивидуальный предприниматель Мацук Елизавета Трофимовна, осуществляющий обработку
            персональных данных, а также определяющий цели обработки персональных данных, состав персональных данных,
            подлежащих обработке, действия (операции), совершаемые с персональными данными.</p>

          <p>2.5. Сайт - веб-сайт, расположенный по адресу: https://icemetr.ru/</p>

          <p>2.6. Пользователь – посетитель сайта. Пользователь является субъектом персональных данных по факту выбора
            услуг предусматривающих передачу персональных данных.</p>

          <p>2.7. Файл cookie – небольшой фрагмент данных, который отправляется сервером веб-сайта и хранится на
            устройстве Пользователя. Используется для сохранения определенных данных, например, каких-либо настроек и
            предпочтений.</p>

          <p>2.8. Согласие на обработку персональных данных – добровольное совершение конклюдентных действий
            Пользователем при выборе услуг, а именно проставление отметки в соответствующей графе, которая предусмотрена
            для выражения Пользователем согласия с обработкой предоставленных им персональных данных (далее – ПДН) и
            безусловного принятия (акцепта) порядка и условий Пользовательского соглашения и настоящей Политики
            конфиденциальности по работе с ПДН Пользователей.</p>

          <p>2.9. Обезличивание персональных данных — действия, в результате которых невозможно определить без
            использования дополнительной информации принадлежность персональных данных конкретному Пользователю или
            иному субъекту персональных данных.</p>

          <p>2.10. Предоставление персональных данных – действия, направленные на раскрытие персональных данных
            определенному лицу или определенному кругу лиц.</p>

          <p>2.11. Распространение персональных данных – любые действия, направленные на раскрытие персональных данных
            неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными
            неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации,
            размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным
            каким-либо иным способом.</p>

          <p>2.12. Уничтожение персональных данных – любые действия, в результате которых персональные данные
            уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в
            информационной системе персональных данных и (или) уничтожаются материальные носители персональных данных.
          </p>

          <h2>3. ОСНОВНЫЕ ПРАВА И ОБЯЗАННОСТИ ОПЕРАТОРА</h2>
          <p>3.1. Оператор имеет право:</p>
          <p>3.1.1. получать от субъекта персональных данных достоверную информацию и/или документы, содержащие
            персональные данные;</p>
          <p>3.1.2. в случае отзыва субъектом персональных данных согласия на обработку персональных данных Оператор
            вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии
            оснований, указанных в Законе о персональных данных;</p>
          <p>3.1.3. самостоятельно определять состав и перечень мер, необходимых и достаточных для обеспечения
            выполнения обязанностей, предусмотренных Законом о персональных данных и принятыми в соответствии с ним
            нормативными правовыми актами, если иное не предусмотрено Законом о персональных данных или другими
            федеральными законами.</p>

          <p>3.2. Оператор обязан:</p>
          <p>3.2.1. предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его
            персональных данных;</p>
          <p>3.2.2. организовывать обработку персональных данных в порядке, установленном действующим законодательством
            Российской Федерации;</p>
          <p>3.2.3. отвечать на обращения и запросы субъектов персональных данных и их законных представителей в
            соответствии с требованиями Закона о персональных данных;</p>
          <p>3.2.4. сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу этого органа
            необходимую информацию в течение 30 дней с даты получения такого запроса;</p>
          <p>3.2.5. публиковать или иным образом обеспечивать неограниченный доступ к настоящей Политике в отношении
            обработки персональных данных;</p>
          <p>3.2.6. принимать правовые, организационные и технические меры для защиты персональных данных от
            неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования,
            предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении
            персональных данных;</p>
          <p>3.2.7. прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить
            обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных
            данных;</p>
          <p>3.2.8. исполнять иные обязанности, предусмотренные Законом о персональных данных.</p>

          <h2>4. ОСНОВНЫЕ ПРАВА И ОБЯЗАННОСТИ СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>4.1. Субъекты персональных данных имеют право:</p>
          <p>4.1.1. получать информацию, касающуюся обработки его персональных данных, за исключением случаев,
            предусмотренных федеральными законами. Сведения предоставляются субъекту персональных данных Оператором в
            доступной форме, и в них не должны содержаться персональные данные, относящиеся к другим субъектам
            персональных данных, за исключением случаев, когда имеются законные основания для раскрытия таких
            персональных данных. Перечень информации и порядок ее получения установлен Законом о персональных данных;
          </p>
          <p>4.1.2. требовать от оператора уточнения его персональных данных, их блокирования или уничтожения в случае,
            если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются
            необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих
            прав;</p>
          <p>4.1.3. выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на
            рынке товаров, работ и услуг;</p>
          <p>4.1.4. предоставлять отзыв согласия на обработку персональных данных;</p>
          <p>4.1.5. обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном
            порядке неправомерные действия или бездействие Оператора при обработке его персональных данных;</p>
          <p>4.1.6. осуществление иных прав, предусмотренных законодательством Российской Федерации.</p>

          <p>4.2. Субъекты персональных данных обязаны:</p>
          <p>4.2.1. предоставлять Оператору достоверные данные о себе;</p>
          <p>4.2.2. сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных.</p>
          <p>4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом субъекте персональных
            данных без согласия последнего, несут ответственность в соответствии с законодательством Российской
            Федерацией.</p>

          <h2>5. СОСТАВ ДАННЫХ</h2>
          <p>5.1. В состав персональных данных Пользователей, обрабатываемых Оператором, входят:</p>
          <ul>
            <li>ФИО;</li>
            <li>Номер телефона;</li>
            <li>Электронная почта;</li>
            <li>Адрес;</li>
            <li>Другие данные, которые потребуются Оператору в соответствии с целями обработки персональных данных,
              закрепленных в разделе 6 настоящей Политики.</li>
          </ul>

          <p>5.2. Сайт может автоматически или с участием Пользователя собирать дополнительную информацию, включая
            IP-адрес, версию браузера, страну, язык, параметры utm, теги партнера, адрес страницы, с которой
            Пользователь произвел переход на Сайт, и другие технические данные, которые могут использоваться для
            идентификации Пользователя без применения дополнительных мер.</p>

          <p>5.3. Дополнительные персональные данные Пользователя, предоставленные Пользователем по личной инициативе
            без истребования таковых Сайтом или же если такие данные, необходимы в целях осуществления той или иной
            услуги.</p>

          <p>5.4. Оператор хранит только сведения в электронном виде, указанные самим Пользователем, содержащие данные о
            Пользователе. Оператор не обрабатывает специальные и биометрические персональные данные Пользователей.</p>

          <p>5.5. Обработка персональных данных Пользователя без их согласия осуществляется в следующих случаях:</p>
          <ul>
            <li>персональные данные являются общедоступными;</li>
            <li>по требованию полномочных государственных органов в случаях, предусмотренных законодательством
              Российской Федерацией;</li>
            <li>обработка персональных данных осуществляется на основании действующего законодательства Российской
              Федерацией;</li>
            <li>обработка персональных данных осуществляется для статистических целей при условии обязательного
              обезличивания персональных данных.</li>
          </ul>

          <p>5.6. Оператор не запрашивает и не обрабатывает специальные категории персональных данных Пользователя:
            данные о его расовой, национальной принадлежности, политических взглядах, религиозных или философских
            убеждениях, состоянии здоровья, интимной жизни.</p>

          <p>5.7. Используя Сайт, Пользователь имеет право заносить данные третьих лиц для заказа товаров.</p>

          <p>5.8. Пользователь обязуется получить предварительное согласие субъекта Персональных данных на их
            использование посредством Сайта. Пользователь самостоятельно несет ответственность за отсутствие такого
            согласия.</p>

          <p>5.9. Оператор обязуется предпринять необходимые меры для обеспечения сохранности Персональных данных
            третьих лиц, занесённых Пользователем.</p>

          <h2>6. ЦЕЛЬ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>6.1. Цель обработки персональных данных Пользователя - осуществление комплекса действий, направленных на
            реализацию следующих задач:</p>
          <ul>
            <li>предоставление Пользователю персонализированных услуг и сервисов;</li>
            <li>для осуществления доставки заказов Пользователя;</li>
            <li>для улучшения качества услуг, оказываемые Оператором;</li>
            <li>для продвижения услуг на рынке путем осуществления прямых контактов с Пользователями;</li>
            <li>идентификации Пользователя для оказания услуг;</li>
            <li>предоставления Пользователю информации об Операторе, сервисах и мероприятиях;</li>
            <li>коммуникации с Пользователем, когда Пользователь обращается к Оператору (форма обратной связи и проч.);
            </li>
            <li>выполнения полномочий и обязанностей, возложенных на Оператор законодательством Российской Федерации;
            </li>
            <li>направления Пользователю новостных материалов Оператора.</li>
          </ul>

          <p>6.2. Оператор передает обработанную информацию транспортным (курьерским) компаниям на основании согласия
            Пользователя (ст. 9 ФЗ «О персональных данных»).</p>

          <p>6.3. Условием прекращения обработки персональных данных является ликвидация Оператора, а также
            соответствующее требование (запрос) Пользователя на удаление его персональных данных.</p>

          <p>6.4. Обработка персональных данных осуществляется на основе принципов:</p>
          <ul>
            <li>законности целей и способов обработки персональных данных;</li>
            <li>добросовестности;</li>
            <li>соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе
              персональных данных;</li>
            <li>соответствия объема и характера обрабатываемых персональных данных, способов обработки персональных
              данных целям обработки персональных данных.</li>
          </ul>

          <h2>7. ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>7.1. Обработка персональных данных осуществляется на законной и справедливой основе.</p>
          <p>7.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных
            целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных.</p>
          <p>7.3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых
            осуществляется в целях, несовместимых между собой.</p>
          <p>7.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки.</p>
          <p>7.5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Не
            допускается избыточность обрабатываемых персональных данных по отношению к заявленным целям их обработки.
          </p>
          <p>7.6. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в
            необходимых случаях и актуальность по отношению к целям обработки персональных данных. Оператор принимает
            необходимые меры и/или обеспечивает их принятие по удалению или уточнению неполных, или неточных данных.</p>
          <p>7.7. Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных
            данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных
            данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или
            поручителем, по которому является субъект персональных данных. Обрабатываемые персональные данные
            уничтожаются либо обезличиваются по достижении целей обработки или в случае утраты необходимости в
            достижении этих целей, если иное не предусмотрено федеральным законом.</p>

          <h2>8. ПРАВОВЫЕ ОСНОВАНИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>8.1. Правовыми основаниями обработки персональных данных Оператором являются:</p>
          <ul>
            <li>Федеральный закон от 27.07.2006 №149-ФЗ «Об информации, информационных технологиях и о защите
              информации»;</li>
            <li>Федеральный закон от 27.07.2006 №152-ФЗ «О персональных данных»;</li>
            <li>Федеральные законы, иные нормативно-правовые акты в сфере защиты персональных данных;</li>
            <li>согласия Пользователей на обработку их персональных данных, на обработку персональных данных,
              разрешенных для распространения.</li>
          </ul>

          <p>8.2. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки
            Пользователем самостоятельно через специальные формы, расположенные на сайте https://icemetr.ru/, или
            направленные Оператору посредством электронной почты. Заполняя соответствующие формы и/или отправляя свои
            персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.</p>

          <p>8.3. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках
            браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).</p>

          <p>8.4. Субъект персональных данных самостоятельно принимает решение о предоставлении его персональных данных
            и дает согласие свободно, своей волей и в своем интересе.</p>

          <h2>9. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>9.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его
            персональных данных.</p>
          <p>9.2. Обработка персональных данных необходима для достижения целей, предусмотренных международным договором
            Российской Федерации или законом, для осуществления возложенных законодательством Российской Федерации на
            оператора функций, полномочий и обязанностей.</p>
          <p>9.3. Обработка персональных данных необходима для осуществления правосудия, исполнения судебного акта, акта
            другого органа или должностного лица, подлежащих исполнению в соответствии с законодательством Российской
            Федерации об исполнительном производстве.</p>
          <p>9.4. Обработка персональных данных необходима для исполнения договора, стороной которого либо
            выгодоприобретателем или поручителем, по которому является субъект персональных данных, а также для
            заключения договора по инициативе субъекта персональных данных или договора, по которому субъект
            персональных данных будет являться выгодоприобретателем или поручителем.</p>
          <p>9.5. Обработка персональных данных необходима для осуществления прав и законных интересов оператора или
            третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и
            свободы субъекта персональных данных.</p>
          <p>9.6. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к которым предоставлен
            субъектом персональных данных либо по его просьбе (далее – общедоступные персональные данные).</p>
          <p>9.7. Осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в
            соответствии с федеральным законом.</p>

          <h2>10. ПОРЯДОК СБОРА, ХРАНЕНИЯ, ПЕРЕДАЧИ И ДРУГИХ ВИДОВ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации
            правовых, организационных и технических мер, необходимых для выполнения в полном объеме требования
            действующего законодательства в области защиты персональных данных.</p>
          <p>10.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие
            доступ к персональным данным неуполномоченных лиц.</p>
          <p>10.2. Защита персональных данных Пользователей осуществляется за счёт Оператора в порядке, установленном
            законодательством Российской Федерацией.</p>
          <p>10.3. У Пользователя могут быть запрошены персональные данные и иная информация третьими лицами.
            Пользователь добровольно передает персональные данные и иную информацию. Все персональные данные,
            запрашиваемые третьими лицами, должны быть обработаны и храниться в соответствии с Пользовательским
            соглашением и Политикой конфиденциальности указанных третьих лиц.</p>
          <p>10.4. Хранение персональных данных Пользователей может осуществляться не дольше, чем этого требуют цели
            обработки, если иное не предусмотрено законодательством Российской Федерацией. В случае удаления аккаунта
            возможно сохранение части информации в той мере, в которой это необходимо для исполнения юридических
            обязательств, урегулирования споров, предотвращения мошенничества и защиты законных интересов Оператора.</p>
          <p>10.5. В течение срока хранения персональные данные не могут быть обезличены или уничтожены.</p>
          <p>10.6. По истечении срока хранения персональные данные могут быть обезличены уничтожены в порядке,
            установленном действующим законодательством Российской Федерацией.</p>
          <p>10.7. Оператор может раскрывать персональные данные Пользователя в рамках закона или для защиты прав и
            интересов, если такое раскрытие является необходимым для соблюдения закона или предотвращения мошенничества.
          </p>
          <p>10.8. Передача (распространение, предоставление, доступ) персональных данных, разрешенных субъектом
            персональных данных для распространения, должна быть прекращена в любое время по требованию субъекта
            персональных данных. Данное требование должно включать в себя фамилию, имя, отчество (при наличии),
            контактную информацию (номер телефона, адрес электронной почты или почтовый адрес) субъекта персональных
            данных, а также перечень персональных данных, обработка которых подлежит прекращению. Указанные в данном
            требовании персональные данные могут обрабатываться только Оператором, которому оно направлено.</p>

          <h2>11. ПЕРЕЧЕНЬ ДЕЙСТВИЙ, ПРОИЗВОДИМЫХ ОПЕРАТОРОМ С ПОЛУЧЕННЫМИ ПЕРСОНАЛЬНЫМИ ДАННЫМИ</h2>
          <p>11.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление,
            изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание,
            блокирование, удаление и уничтожение персональных данных.</p>
          <p>11.2. Оператор осуществляет автоматизированную обработку персональных данных с получением и/или передачей
            полученной информации по информационно- телекоммуникационным сетям или без таковой.</p>

          <h2>12. КАКИЕ ИНЫЕ ДАННЫЕ МОГУТ ОБРАБАТЫВАТЬСЯ</h2>
          <p>12.1. Оператор может осуществлять сбор информации о посещении Сайта пользователями без предоставления
            соответствующей информации самими пользователями. Такая информация может быть получена с помощью различных
            методов, средств и инструментов интернет-статистики и настройки (в частности, файлов Cookie, сервиса
            Яндекс.Метрика). Оператор может использовать такие методы, средства и инструменты для продвижения товаров и
            услуг, реализуемых Оператором, предоставления информации о реализуемых товарах и услугах путем
            предоставления целевой рекламы, а также повышения удобства использования Сайта путем создания профилей
            зарегистрированных пользователей. При этом такие методы, средства и инструменты не используются для
            идентификации незарегистрированных пользователей.</p>
          <p>12.2. Если пользователь Сайта не согласен с тем, что файлы Cookie сохраняются на его устройстве, он может
            самостоятельно отключить эту опцию в настройках браузера. Сохраненные файлы Cookie также можно удалить в
            любое время в системных настройках браузера. Пользователь Сайта может изменить настройки браузера, чтобы
            принимать или отклонять по умолчанию все файлы Cookie либо файлы Cookie с определенных сайтов, включая Сайт.
          </p>
          <p>12.3. Отключение некоторых файлов Cookie может привести к тому, что использование отдельных разделов или
            функций Сайта станет невозможным.</p>
          <p>12.4. Если пользователь Сайта не согласен с использованием методов, средств и инструментов
            интернет-статистики и настройки, он должен прекратить использование Сайта, в этом случае Оператор не сможет
            обеспечить пользователю использование Сайта.</p>

          <h2>13. ПОРЯДОК УНИЧТОЖЕНИЯ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
          <p>13.1. Уничтожение персональных данных – действия, в результате которых становится невозможным восстановить
            содержание персональных данных в информационной системе персональных данных и (или) в результате которых
            уничтожаются материальные носители персональных данных, а также прекращение какого-либо доступа к
            персональным данным.</p>
          <p>13.2. Персональные данные в системе Оператора и на Сайте восстановлению не подлежат.</p>
          <p>13.3. Операция уничтожения персональных данных необратима.</p>
          <p>13.4. Срок уничтожения персональных данных соответствует сроку, определенному законодательством Российской
            Федерацией.</p>

          <h2>14. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
          <p>14.1. В случае невыполнения своих обязательств Оператор принимает на себя ответственность за любые убытки,
            понесенные Пользователем в результате несанкционированного использования его персональных данных, в
            соответствии с законодательством Российской Федерации за исключением случаев, когда персональные данные:</p>
          <ul>
            <li>были предоставлены по требованию органов государственной власти в соответствии с действующим
              законодательством Российской Федерацией;</li>
            <li>были раскрыты третьей стороной после того, как они были переданы Оператору c согласия Пользователя;</li>
            <li>были раскрыты в результате возникновения обоснованной претензии в адрес Пользователя о нарушении прав
              третьих лиц и/или Пользовательского соглашения;</li>
            <li>стали публичными до того, как они были утеряны или раскрыты;</li>
            <li>были получены от третьего лица до предоставления их Оператору;</li>
            <li>были раскрыты в результате форс-мажорных обстоятельств.</li>
          </ul>
          <p>14.2. Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и
            не распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено
            федеральным законом.</p>

          <h2>15. РАЗРЕШЕНИЕ СПОРОВ</h2>
          <p>15.1. Стороны несут ответственность за неисполнение, либо ненадлежащее исполнение принятых на себя
            обязательств в соответствии с законодательством Российской Федерации.</p>
          <p>15.2. При невозможности урегулирования Сторонами возникших разногласий путем переговоров, спор подлежит
            разрешению по месту нахождения Оператора с обязательным соблюдением претензионного порядка урегулирования
            споров и разногласий.</p>
          <p>15.3. Срок ответа на претензию 15 (пятнадцать) календарных дней с момента ее поступления в письменной форме
            или в электронном виде.</p>

          <h2>16. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
          <p>16.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его
            персональных данных, обратившись к Оператору.</p>
          <p>16.2. Нажимая кнопку «перейти к оформлению» в корзине сайта, клиент подтверждает следующее и дает свое
            согласие на участие в смс и email рассылке:</p>
          <ul>
            <li>Подтверждаю, что введенные мной данные (фамилия, имя, отчество, электронный адрес, телефон) являются
              корректными;</li>
            <li>Подтверждаю, что все данные предоставляются добровольно;</li>
            <li>Выражаю полное и безоговорочное согласие на использование моих данных для поддержания связи со мной
              любым способом, включая телефонные звонки на указанный стационарный и/или мобильный телефон, отправку
              СМС-сообщений на указанный мобильный телефон, отправку электронных писем на указанный электронный адрес с
              целью информирования о поступлении новых товаров/услуг, оповещения о проводимых акциях, мероприятиях,
              скидках, их результатах. Для осуществления заочных опросов с целью изучения мнения о товарах/услугах,
              организациях торговли, высылки новостей и т.п. согласие предоставляется</li>
          </ul>
          <p>16.3. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором.
            Политика действует бессрочно до замены ее новой версией.</p>
          <p>16.4. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу <a
              href="https://icemetr.ru/" target="_blank">https://icemetr.ru/</a>.</p>
        </div>

        <div class="requisites">
          <h3>Реквизиты:</h3>
          <p>Индивидуальный предприниматель Мацук Елизавета Трофимовна</p>
          <p>Юридический адрес: 670031, Россия, Бурятия Респ., Улан-Удэ г., Трубачеева 144а, кв.31</p>
          <p>ОГРНИП: 325030000027200</p>
          <p>ИНН: 032301867576</p>
          <p>Тел.: +7 983 420 05 000</p>
          <p>E-mail: <a href="mailto:arena@icemetr.ru">arena@icemetr.ru</a></p>
        </div>

        <div class="modal-footer">
          <button @click="closeModal" class="primary">Закрыть</button>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { defineProps, defineEmits } from 'vue';

const props = defineProps({
  showPolicyModal: {
    type: Boolean,
    required: true
  }
})

const emit = defineEmits(['close'])

const closeModal = () => {
  emit('close');
}
</script>

<style scoped>
@import "../assets/modals-styles.css";
</style>
