<template>
  <div class="modal-overlay" v-if="props.showRules">
    <div class="modal-container">
      <div class="modal-content">
        <h1>Правила посещения Ледовой арены ICE метр</h1>
        
        <div class="policy-section">
          <h2>Основные положения правил посещения Ледовой арены ICE метр</h2>
          <ol>
            <li>Посещение Ледовой арены является для посетителей делом сугубо добровольным и все риски, связанные с посещением Ледовой арены, посетитель берет на себя;</li>
            <li>Дети до 7 лет на массовые катания допускаются только в сопровождении родителей;</li>
            <li>Посетители несут полную ответственность за свою жизнь и здоровье. Взрослые, сопровождающие детей, несут полную ответственность за жизнь и здоровье сопровождаемого;</li>
            <li>Выход на лёд осуществляется только в коньках. Выход на лед в обычной обуви строго запрещен;</li>
            <li>Хождение на коньках вне Ледового поля допускается исключительно по резиновому покрытию;</li>
            <li>Направление движения посетителей на ледовом поле при массовом катании – против часовой стрелки;</li>
            <li>Во избежание столкновения во время движения по льду необходимо соблюдать безопасную дистанцию;</li>
            <li>Сразу по окончанию сеанса массовых катаний необходимо покинуть ледовое поле;</li>
            <li>Если во время катания ухудшилось Ваше самочувствие, или Вы получили травму, необходимо обратиться к сотруднику Ледовой арены для сопровождения в медицинский кабинет, с целью оказания первой доврачебной помощи или вызова бригады скорой помощи;</li>
            <li>Проход на трибуны, за турникет во время тренировочного процесса, массовых катаний, спортивно-массовых мероприятий осуществляется только на возмездной основе через стойку рецепции. Размер стоимости устанавливается администрацией Ледовой арены в зависимости от мероприятия.</li>
          </ol>

          <h2>Администрация Ледовой арены настоятельно не рекомендует выходить на лёд:</h2>
          <ul>
            <li>беременным женщинам;</li>
            <li>лицам, страдающим сердечно-сосудистыми заболеваниями, эпилепсией, психоневрологическими расстройствами;</li>
            <li>лицам с острым периодом ОРВИ, ОРЗ;</li>
            <li>лицам с расстройством вестибулярного аппарата.</li>
          </ul>

          <h2>На Ледовой арене ICE метр запрещается:</h2>
          <ul>
            <li>проносить на арену огнеопасные, взрывчатые, легковоспламеняющиеся вещества, огнестрельное и холодное оружие, наркотические и психотропные вещества, спиртные напитки;</li>
            <li>проносить на ледовое поле напитки, еду, сумки, пакеты, колющие, режущие и бьющиеся предметы;</li>
            <li>проносить на ледовое поле клюшки, шайбы и иной инвентарь во время работы арены для массового посещения;</li>
            <li>оставлять на бортах одежду и иные посторонние предметы, а также бросать на лёд любые предметы;</li>
            <li>курить на территории арены;</li>
            <li>держать детей на руках во время катания;</li>
            <li>выходить на ледовое поле в состоянии алкогольного и наркотического опьянения;</li>
            <li>кататься на большой скорости, создавая помехи движению катающихся;</li>
            <li>портить инвентарь, коньки и оборудование Ледовой арены, наносить вред имуществу посетителей.</li>
          </ul>

          <h2>Администрация Ледовой арены ICE метр не несёт ответственности:</h2>
          <ul>
            <li>за здоровье Посетителей, несчастные случаи и травмы на территории арены, связанные с нарушением данных правил;</li>
            <li>за кражу или утерю одежды, документов, денег, сотовых телефонов, ювелирные украшений и иных ценных вещей, оставленных без присмотра.</li>
          </ul>

          <p>С полным текстом правил посещения Ледовой арены Вы можете ознакомиться на стойке ресепшен в фойе ледовой арены.</p>

          <h2>Правила возврата билетов:</h2>
          <p><strong>Билеты являются НЕВОЗВРАТНЫМИ.</strong></p>

          <p><strong>Приобретение абонемента или оплата разового посещения означает полное согласие Посетителя с правилами посещения Ледовой арены.</strong></p>

          <p class="highlight">От соблюдения настоящих правил зависит Ваше здоровье и хорошее настроение! Желаем Вам приятного катания и ждем Вас снова!</p>
        </div>
      </div>

      <div class="modal-footer">
        <button @click="closeModal" class="primary">Закрыть</button>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import {defineProps, defineEmits } from 'vue';

const props = defineProps({
    showRules: {
        type: Boolean,
        required: true
    }
})

const emit = defineEmits(['close'])

const closeModal = () => {
    emit('close');
}
</script>

<style scoped>
@import "../assets/modals-styles.css";
</style>